---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.Erase(Autodesk.Revit.DB.Electrical.Wire)
source: html/41480af2-b195-165e-5b37-b9e3ba41e2bc.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.Erase Method

## Syntax (C#)
```csharp
public virtual int Erase(
	Wire item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.Wire`)